0: PAD_None
1: BOS_None
2: EOS_None
3: MASK_None
4: Bar_None
5: Pitch_21
6: Pitch_22
7: Pitch_23
8: Pitch_24
9: Pitch_25
10: Pitch_26
11: Pitch_27
12: Pitch_28
13: Pitch_29
14: Pitch_30
15: Pitch_31
16: Pitch_32
17: Pitch_33
18: Pitch_34
19: Pitch_35
20: Pitch_36
21: Pitch_37
22: Pitch_38
23: Pitch_39
24: Pitch_40
25: Pitch_41
26: Pitch_42
27: Pitch_43
28: Pitch_44
29: Pitch_45
30: Pitch_46
31: Pitch_47
32: Pitch_48
33: Pitch_49
34: Pitch_50
35: Pitch_51
36: Pitch_52
37: Pitch_53
38: Pitch_54
39: Pitch_55
40: Pitch_56
41: Pitch_57
42: Pitch_58
43: Pitch_59
44: Pitch_60
45: Pitch_61
46: Pitch_62
47: Pitch_63
48: Pitch_64
49: Pitch_65
50: Pitch_66
51: Pitch_67
52: Pitch_68
53: Pitch_69
54: Pitch_70
55: Pitch_71
56: Pitch_72
57: Pitch_73
58: Pitch_74
59: Pitch_75
60: Pitch_76
61: Pitch_77
62: Pitch_78
63: Pitch_79
64: Pitch_80
65: Pitch_81
66: Pitch_82
67: Pitch_83
68: Pitch_84
69: Pitch_85
70: Pitch_86
71: Pitch_87
72: Pitch_88
73: Pitch_89
74: Pitch_90
75: Pitch_91
76: Pitch_92
77: Pitch_93
78: Pitch_94
79: Pitch_95
80: Pitch_96
81: Pitch_97
82: Pitch_98
83: Pitch_99
84: Pitch_100
85: Pitch_101
86: Pitch_102
87: Pitch_103
88: Pitch_104
89: Pitch_105
90: Pitch_106
91: Pitch_107
92: Pitch_108
93: Pitch_109
94: Velocity_3
95: Velocity_7
96: Velocity_11
97: Velocity_15
98: Velocity_19
99: Velocity_23
100: Velocity_27
101: Velocity_31
102: Velocity_35
103: Velocity_39
104: Velocity_43
105: Velocity_47
106: Velocity_51
107: Velocity_55
108: Velocity_59
109: Velocity_63
110: Velocity_67
111: Velocity_71
112: Velocity_75
113: Velocity_79
114: Velocity_83
115: Velocity_87
116: Velocity_91
117: Velocity_95
118: Velocity_99
119: Velocity_103
120: Velocity_107
121: Velocity_111
122: Velocity_115
123: Velocity_119
124: Velocity_123
125: Velocity_127
126: Duration_0.1.32
127: Duration_0.2.32
128: Duration_0.3.32
129: Duration_0.4.32
130: Duration_0.5.32
131: Duration_0.6.32
132: Duration_0.7.32
133: Duration_0.8.32
134: Duration_0.9.32
135: Duration_0.10.32
136: Duration_0.11.32
137: Duration_0.12.32
138: Duration_0.13.32
139: Duration_0.14.32
140: Duration_0.15.32
141: Duration_0.16.32
142: Duration_0.17.32
143: Duration_0.18.32
144: Duration_0.19.32
145: Duration_0.20.32
146: Duration_0.21.32
147: Duration_0.22.32
148: Duration_0.23.32
149: Duration_0.24.32
150: Duration_0.25.32
151: Duration_0.26.32
152: Duration_0.27.32
153: Duration_0.28.32
154: Duration_0.29.32
155: Duration_0.30.32
156: Duration_0.31.32
157: Duration_1.0.32
158: Duration_1.1.32
159: Duration_1.2.32
160: Duration_1.3.32
161: Duration_1.4.32
162: Duration_1.5.32
163: Duration_1.6.32
164: Duration_1.7.32
165: Duration_1.8.32
166: Duration_1.9.32
167: Duration_1.10.32
168: Duration_1.11.32
169: Duration_1.12.32
170: Duration_1.13.32
171: Duration_1.14.32
172: Duration_1.15.32
173: Duration_1.16.32
174: Duration_1.17.32
175: Duration_1.18.32
176: Duration_1.19.32
177: Duration_1.20.32
178: Duration_1.21.32
179: Duration_1.22.32
180: Duration_1.23.32
181: Duration_1.24.32
182: Duration_1.25.32
183: Duration_1.26.32
184: Duration_1.27.32
185: Duration_1.28.32
186: Duration_1.29.32
187: Duration_1.30.32
188: Duration_1.31.32
189: Duration_2.0.32
190: Duration_2.1.32
191: Duration_2.2.32
192: Duration_2.3.32
193: Duration_2.4.32
194: Duration_2.5.32
195: Duration_2.6.32
196: Duration_2.7.32
197: Duration_2.8.32
198: Duration_2.9.32
199: Duration_2.10.32
200: Duration_2.11.32
201: Duration_2.12.32
202: Duration_2.13.32
203: Duration_2.14.32
204: Duration_2.15.32
205: Duration_2.16.32
206: Duration_2.17.32
207: Duration_2.18.32
208: Duration_2.19.32
209: Duration_2.20.32
210: Duration_2.21.32
211: Duration_2.22.32
212: Duration_2.23.32
213: Duration_2.24.32
214: Duration_2.25.32
215: Duration_2.26.32
216: Duration_2.27.32
217: Duration_2.28.32
218: Duration_2.29.32
219: Duration_2.30.32
220: Duration_2.31.32
221: Duration_3.0.32
222: Duration_3.1.32
223: Duration_3.2.32
224: Duration_3.3.32
225: Duration_3.4.32
226: Duration_3.5.32
227: Duration_3.6.32
228: Duration_3.7.32
229: Duration_3.8.32
230: Duration_3.9.32
231: Duration_3.10.32
232: Duration_3.11.32
233: Duration_3.12.32
234: Duration_3.13.32
235: Duration_3.14.32
236: Duration_3.15.32
237: Duration_3.16.32
238: Duration_3.17.32
239: Duration_3.18.32
240: Duration_3.19.32
241: Duration_3.20.32
242: Duration_3.21.32
243: Duration_3.22.32
244: Duration_3.23.32
245: Duration_3.24.32
246: Duration_3.25.32
247: Duration_3.26.32
248: Duration_3.27.32
249: Duration_3.28.32
250: Duration_3.29.32
251: Duration_3.30.32
252: Duration_3.31.32
253: Duration_4.0.16
254: Duration_4.1.16
255: Duration_4.2.16
256: Duration_4.3.16
257: Duration_4.4.16
258: Duration_4.5.16
259: Duration_4.6.16
260: Duration_4.7.16
261: Duration_4.8.16
262: Duration_4.9.16
263: Duration_4.10.16
264: Duration_4.11.16
265: Duration_4.12.16
266: Duration_4.13.16
267: Duration_4.14.16
268: Duration_4.15.16
269: Duration_5.0.16
270: Duration_5.1.16
271: Duration_5.2.16
272: Duration_5.3.16
273: Duration_5.4.16
274: Duration_5.5.16
275: Duration_5.6.16
276: Duration_5.7.16
277: Duration_5.8.16
278: Duration_5.9.16
279: Duration_5.10.16
280: Duration_5.11.16
281: Duration_5.12.16
282: Duration_5.13.16
283: Duration_5.14.16
284: Duration_5.15.16
285: Duration_6.0.16
286: Duration_6.1.16
287: Duration_6.2.16
288: Duration_6.3.16
289: Duration_6.4.16
290: Duration_6.5.16
291: Duration_6.6.16
292: Duration_6.7.16
293: Duration_6.8.16
294: Duration_6.9.16
295: Duration_6.10.16
296: Duration_6.11.16
297: Duration_6.12.16
298: Duration_6.13.16
299: Duration_6.14.16
300: Duration_6.15.16
301: Duration_7.0.16
302: Duration_7.1.16
303: Duration_7.2.16
304: Duration_7.3.16
305: Duration_7.4.16
306: Duration_7.5.16
307: Duration_7.6.16
308: Duration_7.7.16
309: Duration_7.8.16
310: Duration_7.9.16
311: Duration_7.10.16
312: Duration_7.11.16
313: Duration_7.12.16
314: Duration_7.13.16
315: Duration_7.14.16
316: Duration_7.15.16
317: Duration_8.0.16
318: Duration_8.1.16
319: Duration_8.2.16
320: Duration_8.3.16
321: Duration_8.4.16
322: Duration_8.5.16
323: Duration_8.6.16
324: Duration_8.7.16
325: Duration_8.8.16
326: Duration_8.9.16
327: Duration_8.10.16
328: Duration_8.11.16
329: Duration_8.12.16
330: Duration_8.13.16
331: Duration_8.14.16
332: Duration_8.15.16
333: Duration_9.0.16
334: Duration_9.1.16
335: Duration_9.2.16
336: Duration_9.3.16
337: Duration_9.4.16
338: Duration_9.5.16
339: Duration_9.6.16
340: Duration_9.7.16
341: Duration_9.8.16
342: Duration_9.9.16
343: Duration_9.10.16
344: Duration_9.11.16
345: Duration_9.12.16
346: Duration_9.13.16
347: Duration_9.14.16
348: Duration_9.15.16
349: Duration_10.0.16
350: Duration_10.1.16
351: Duration_10.2.16
352: Duration_10.3.16
353: Duration_10.4.16
354: Duration_10.5.16
355: Duration_10.6.16
356: Duration_10.7.16
357: Duration_10.8.16
358: Duration_10.9.16
359: Duration_10.10.16
360: Duration_10.11.16
361: Duration_10.12.16
362: Duration_10.13.16
363: Duration_10.14.16
364: Duration_10.15.16
365: Duration_11.0.16
366: Duration_11.1.16
367: Duration_11.2.16
368: Duration_11.3.16
369: Duration_11.4.16
370: Duration_11.5.16
371: Duration_11.6.16
372: Duration_11.7.16
373: Duration_11.8.16
374: Duration_11.9.16
375: Duration_11.10.16
376: Duration_11.11.16
377: Duration_11.12.16
378: Duration_11.13.16
379: Duration_11.14.16
380: Duration_11.15.16
381: Duration_12.0.16
382: Position_0
383: Position_1
384: Position_2
385: Position_3
386: Position_4
387: Position_5
388: Position_6
389: Position_7
390: Position_8
391: Position_9
392: Position_10
393: Position_11
394: Position_12
395: Position_13
396: Position_14
397: Position_15
398: Position_16
399: Position_17
400: Position_18
401: Position_19
402: Position_20
403: Position_21
404: Position_22
405: Position_23
406: Position_24
407: Position_25
408: Position_26
409: Position_27
410: Position_28
411: Position_29
412: Position_30
413: Position_31
414: Position_32
415: Position_33
416: Position_34
417: Position_35
418: Position_36
419: Position_37
420: Position_38
421: Position_39
422: Position_40
423: Position_41
424: Position_42
425: Position_43
426: Position_44
427: Position_45
428: Position_46
429: Position_47
430: Position_48
431: Position_49
432: Position_50
433: Position_51
434: Position_52
435: Position_53
436: Position_54
437: Position_55
438: Position_56
439: Position_57
440: Position_58
441: Position_59
442: Position_60
443: Position_61
444: Position_62
445: Position_63
446: Position_64
447: Position_65
448: Position_66
449: Position_67
450: Position_68
451: Position_69
452: Position_70
453: Position_71
454: Position_72
455: Position_73
456: Position_74
457: Position_75
458: Position_76
459: Position_77
460: Position_78
461: Position_79
462: Position_80
463: Position_81
464: Position_82
465: Position_83
466: Position_84
467: Position_85
468: Position_86
469: Position_87
470: Position_88
471: Position_89
472: Position_90
473: Position_91
474: Position_92
475: Position_93
476: Position_94
477: Position_95
478: Position_96
479: Position_97
480: Position_98
481: Position_99
482: Position_100
483: Position_101
484: Position_102
485: Position_103
486: Position_104
487: Position_105
488: Position_106
489: Position_107
490: Position_108
491: Position_109
492: Position_110
493: Position_111
494: Position_112
495: Position_113
496: Position_114
497: Position_115
498: Position_116
499: Position_117
500: Position_118
501: Position_119
502: Position_120
503: Position_121
504: Position_122
505: Position_123
506: Position_124
507: Position_125
508: Position_126
509: Position_127
510: PitchDrum_27
511: PitchDrum_28
512: PitchDrum_29
513: PitchDrum_30
514: PitchDrum_31
515: PitchDrum_32
516: PitchDrum_33
517: PitchDrum_34
518: PitchDrum_35
519: PitchDrum_36
520: PitchDrum_37
521: PitchDrum_38
522: PitchDrum_39
523: PitchDrum_40
524: PitchDrum_41
525: PitchDrum_42
526: PitchDrum_43
527: PitchDrum_44
528: PitchDrum_45
529: PitchDrum_46
530: PitchDrum_47
531: PitchDrum_48
532: PitchDrum_49
533: PitchDrum_50
534: PitchDrum_51
535: PitchDrum_52
536: PitchDrum_53
537: PitchDrum_54
538: PitchDrum_55
539: PitchDrum_56
540: PitchDrum_57
541: PitchDrum_58
542: PitchDrum_59
543: PitchDrum_60
544: PitchDrum_61
545: PitchDrum_62
546: PitchDrum_63
547: PitchDrum_64
548: PitchDrum_65
549: PitchDrum_66
550: PitchDrum_67
551: PitchDrum_68
552: PitchDrum_69
553: PitchDrum_70
554: PitchDrum_71
555: PitchDrum_72
556: PitchDrum_73
557: PitchDrum_74
558: PitchDrum_75
559: PitchDrum_76
560: PitchDrum_77
561: PitchDrum_78
562: PitchDrum_79
563: PitchDrum_80
564: PitchDrum_81
565: PitchDrum_82
566: PitchDrum_83
567: PitchDrum_84
568: PitchDrum_85
569: PitchDrum_86
570: PitchDrum_87
571: PitchDrum_88
572: Chord_min
573: Chord_maj
574: Chord_dim
575: Chord_aug
576: Chord_sus2
577: Chord_sus4
578: Chord_7dom
579: Chord_7min
580: Chord_7maj
581: Chord_7halfdim
582: Chord_7dim
583: Chord_7aug
584: Chord_9maj
585: Chord_9min
586: Tempo_40.0
587: Tempo_46.77
588: Tempo_53.55
589: Tempo_60.32
590: Tempo_67.1
591: Tempo_73.87
592: Tempo_80.65
593: Tempo_87.42
594: Tempo_94.19
595: Tempo_100.97
596: Tempo_107.74
597: Tempo_114.52
598: Tempo_121.29
599: Tempo_128.06
600: Tempo_134.84
601: Tempo_141.61
602: Tempo_148.39
603: Tempo_155.16
604: Tempo_161.94
605: Tempo_168.71
606: Tempo_175.48
607: Tempo_182.26
608: Tempo_189.03
609: Tempo_195.81
610: Tempo_202.58
611: Tempo_209.35
612: Tempo_216.13
613: Tempo_222.9
614: Tempo_229.68
615: Tempo_236.45
616: Tempo_243.23
617: Tempo_250.0
